tap "nikitabobko/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Vector graphics library with cross-device output support
brew "cairo"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GNU debugger
brew "gdb"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Utility for directing compilation
brew "make"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Theme for zsh
brew "powerlevel10k"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Web browser focusing on privacy
cask "brave-browser"
# Colemak mod for more comfortable typing (DH variant)
cask "colemak-dh"
# Voice and text chat software
cask "discord"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Control your tools with a few keystrokes
cask "raycast"
# To-do & task list manager
cask "ticktick"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
